In [15]:
import pandas as pd
data = [1,2,3,4]
series1 = pd.Series(data)
series1

0    1
1    2
2    3
3    4
dtype: int64

In [16]:
type(series1)

pandas.core.series.Series

In [17]:
series1 = pd.Series(data, index = ['a','b','c','d'])
series1

a    1
b    2
c    3
d    4
dtype: int64

**DataFrame**

DataFrame merupakan array dua dimensi dengan baris dan kolom. Struktur data ini
merupakan cara paling standar untuk menyimpan data. Secara sederhana, DataFrame
merupakan tabel/data tabular. Setiap kolom pada DataFrame merupakan objek dari
Series, dan baris terdiri dari elemen yang ada pada Series. Contoh DataFrame.

DataFrame Menggunakan List

In [18]:
import pandas as pd
data = [1,2,3,4]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4

DataFrame Menggunakan Dictionary

In [19]:
dictionary = {'buah' : ['Apel','Jeruk','Lemon'],'jumlah':[10,5,12]}
df = pd.DataFrame(dictionary)
df

    buah  jumlah
0   Apel      10
1  Jeruk       5
2  Lemon      12

DataFrame Menggunakan List dengan Tipe Data Campuran

In [20]:
import pandas as pd
data = [['Berti',90,85,95,90.5],
       ['Qorygore',80,85,90,86.6],
       ['Bimo',70,75,80,78.5]]
index = [0,1,2]
kolom = ['Nama','Tugas','UTS','UAS','RATA_RATA']
df = pd.DataFrame(data, index, kolom)
df

       Nama  Tugas  UTS  UAS  RATA_RATA
0     Berti     90   85   95       90.5
1  Qorygore     80   85   90       86.6
2      Bimo     70   75   80       78.5

DataFrame Menggunakan List & Dictionary dengan Tipe Data Campuran

In [21]:
# atau dengan Dictionary
import pandas as pd
nama = ['Berti','Qorygore','Bimo']
tugas = [90,80,70]
uts = [85,85,75]
uas = [95,90,80]
ratarata = [90.5,86.6,78.5]
df2 = pd.DataFrame({'Nama':nama,'Tugas':tugas,'UTS':uts,'UAS':uas,'Rata-Rata':ratarata})
df2

       Nama  Tugas  UTS  UAS  Rata-Rata
0     Berti     90   85   95       90.5
1  Qorygore     80   85   90       86.6
2      Bimo     70   75   80       78.5

**Merge, Join, & Concatenate DataFrame**

Ketiga fungsi ini pengertiannya adalah operasi penggabungan. Perbedaannya adalah
sebagai berikut.

**Merge**

Merge adalah operasi penggabungan antara DataFrame Objects.

Siapkan 2 Data

In [22]:
# DATA PERTAMA
import pandas as pd
nama = ['Berti','Ryndes','Arin']
tugas = [95,90,75]
jurusan = ['IF','SI','KA']
df3 = pd.DataFrame({'Nama':nama,'Tugas':tugas,'Jurusan':jurusan})
df3

     Nama  Tugas Jurusan
0   Berti     95      IF
1  Ryndes     90      SI
2    Arin     75      KA

In [23]:
# DATA KEDUA
nama = ['Berti','Ryndes','Rylo']
uts = [85,84,70]
jurusan = ['IF','SI','SI']
df4 = pd.DataFrame({'Nama':nama,'UTS':uts,'Jurusan':jurusan})
df4

     Nama  UTS Jurusan
0   Berti   85      IF
1  Ryndes   84      SI
2    Rylo   70      SI

Inner Merge

In [24]:
# INNER MERGE
df3.merge(df4)

     Nama  Tugas Jurusan  UTS
0   Berti     95      IF   85
1  Ryndes     90      SI   84

Left Merge

In [25]:
# LEFT MERGE
df3.merge(df4,on='Nama', how='left')

     Nama  Tugas Jurusan_x   UTS Jurusan_y
0   Berti     95        IF  85.0        IF
1  Ryndes     90        SI  84.0        SI
2    Arin     75        KA   NaN       NaN

Right Merge

In [26]:
# RIGHT MERGE
df3.merge(df4, on='Nama', how='right')

     Nama  Tugas Jurusan_x  UTS Jurusan_y
0   Berti   95.0        IF   85        IF
1  Ryndes   90.0        SI   84        SI
2    Rylo    NaN       NaN   70        SI

Outer Merge

In [27]:
# OUTER MERGE
df3.merge(df4, on='Nama', how='outer')

     Nama  Tugas Jurusan_x   UTS Jurusan_y
0   Berti   95.0        IF  85.0        IF
1  Ryndes   90.0        SI  84.0        SI
2    Arin   75.0        KA   NaN       NaN
3    Rylo    NaN       NaN  70.0        SI

**Join**

Join adalah operasi penggabungan dengan menggunakan index

Siapkan 2 Data

In [28]:
# DATA PERTAMA
nama = ['Berti','Ryndes','Arin']
tugas = [95,90,75]
jurusan = ['IF','SI','KA']
df3 = pd.DataFrame({'Nama':nama,'Tugas':tugas,'Jurusan':jurusan}, index=['L1','L2','L3'])
df3

      Nama  Tugas Jurusan
L1   Berti     95      IF
L2  Ryndes     90      SI
L3    Arin     75      KA

In [29]:
# DATA KEDUA
nama = ['Berti','Ryndes','Rylo']
uts = [85,84,70]
jurusan = ['IF','SI','SI']
df4 = pd.DataFrame({'Nama B':nama,'UTS':uts,'Jurusan B':jurusan}, index=['L2','L3','L4'])
df4

    Nama B  UTS Jurusan B
L2   Berti   85        IF
L3  Ryndes   84        SI
L4    Rylo   70        SI

Inner Join

In [30]:
# INNER JOIN
df3.join(df4, how='inner')

      Nama  Tugas Jurusan  Nama B  UTS Jurusan B
L2  Ryndes     90      SI   Berti   85        IF
L3    Arin     75      KA  Ryndes   84        SI

Left Join

In [31]:
# LEFT JOIN
df3.join(df4, how='left')

      Nama  Tugas Jurusan  Nama B   UTS Jurusan B
L1   Berti     95      IF     NaN   NaN       NaN
L2  Ryndes     90      SI   Berti  85.0        IF
L3    Arin     75      KA  Ryndes  84.0        SI

Right Join

In [32]:
# RIGHT JOIN
df3.join(df4,how='right')

      Nama  Tugas Jurusan  Nama B  UTS Jurusan B
L2  Ryndes   90.0      SI   Berti   85        IF
L3    Arin   75.0      KA  Ryndes   84        SI
L4     NaN    NaN     NaN    Rylo   70        SI

Outer Join

In [33]:
# OUTER JOIN
df3.join(df4, how='outer')

      Nama  Tugas Jurusan  Nama B   UTS Jurusan B
L1   Berti   95.0      IF     NaN   NaN       NaN
L2  Ryndes   90.0      SI   Berti  85.0        IF
L3    Arin   75.0      KA  Ryndes  84.0        SI
L4     NaN    NaN     NaN    Rylo  70.0        SI

**Concatenate**

Concatenate adalah operasi gabungan penggabungan objek DataFrame secara vertical.

In [34]:
pd.concat([df3,df4], sort='False')

C:\Users\lenovo\AppData\Local\Temp\ipykernel_5432\2183828127.py:1: FutureWarning: Passing non boolean values for sort is deprecated and will error in a future version!
  pd.concat([df3,df4], sort='False')

   Jurusan Jurusan B    Nama  Nama B  Tugas   UTS
L1      IF       NaN   Berti     NaN   95.0   NaN
L2      SI       NaN  Ryndes     NaN   90.0   NaN
L3      KA       NaN    Arin     NaN   75.0   NaN
L2     NaN        IF     NaN   Berti    NaN  85.0
L3     NaN        SI     NaN  Ryndes    NaN  84.0
L4     NaN        SI     NaN    Rylo    NaN  70.0

**Pandas DataFrame - Import Data CSV**

pada tahap ini akan dibahas mengenai cara import data CSV ke dalam panda DataFrame dan mengolah datanya.

Import Data CSV

In [37]:
import pandas as pd

# membaca dataset dan store ke dataframe
sample = pd.read_csv("dataspotify.csv")

# print
sample

               Nama Band  Tahun Berdiri  Pendengar per Bulan
0               Slipknot           1995              6603189
1            Linkin Park           1996             17418362
2      Avenged Sevenfold           1999              5410274
3   Bring Me the Horizon           2004              4428374
4              Green Day           1987             15692462
5                   Muse           1994              8528417
6         As I Lay Dying           2000               996422
7                Trivium           1999              1880758
8            Limp Bizkit           1994              5910689
9               Skid Row           1986              2492044
10              Bon Jovi           1983             15581843

**Macam - Macam Operasi**

Fungsi-fungsi yang dapat dilakukan oleh Pandas DataFrame adalah sebagai berikut

Head()

In [38]:
# head() menampilkan 5 records pertama
sample.head()

              Nama Band  Tahun Berdiri  Pendengar per Bulan
0              Slipknot           1995              6603189
1           Linkin Park           1996             17418362
2     Avenged Sevenfold           1999              5410274
3  Bring Me the Horizon           2004              4428374
4             Green Day           1987             15692462

In [39]:
# menampilkan 2 records pertama
sample.head(2)

     Nama Band  Tahun Berdiri  Pendengar per Bulan
0     Slipknot           1995              6603189
1  Linkin Park           1996             17418362

tail()

In [40]:
# tail(), menampilkan 5 records terakhir
sample.tail()

         Nama Band  Tahun Berdiri  Pendengar per Bulan
6   As I Lay Dying           2000               996422
7          Trivium           1999              1880758
8      Limp Bizkit           1994              5910689
9         Skid Row           1986              2492044
10        Bon Jovi           1983             15581843

In [41]:
# menampilkan 3 records terakhir
sample.tail(3)

      Nama Band  Tahun Berdiri  Pendengar per Bulan
8   Limp Bizkit           1994              5910689
9      Skid Row           1986              2492044
10     Bon Jovi           1983             15581843

Shape

In [42]:
# menampilkan jumlah baris dan kolom pada DataFrame
sample.shape

(11, 3)

Mean,Median,Standar Deviasi

In [43]:
# mean adalah rata-rata
# 2.785714e+01 artinya 2.785714 * 10^1 = 2.785714 * 10 jadi Mean-nya adalah 27.85714
# 2.360000e+06 artinya 2.360000 * 10^6 = 2.360000 * 1000000 jadi Mean-nya adalah 2360000
sample.mean()

C:\Users\lenovo\AppData\Local\Temp\ipykernel_5432\869767404.py:4: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  sample.mean()

Tahun Berdiri          1.994273e+03
Pendengar per Bulan    7.722076e+06
dtype: float64

In [44]:
# median adalah nilai tengah dari data yang telah diurut dari terkecil hingga terbesar
# umur : 23 25 26 28 29 30 34
sample.median()

C:\Users\lenovo\AppData\Local\Temp\ipykernel_5432\2166340932.py:3: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  sample.median()

Tahun Berdiri             1995.0
Pendengar per Bulan    5910689.0
dtype: float64

In [45]:
# standar deviasi
sample.std()

C:\Users\lenovo\AppData\Local\Temp\ipykernel_5432\4082167482.py:2: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  sample.std()

Tahun Berdiri          6.512924e+00
Pendengar per Bulan    5.894113e+06
dtype: float64

Max, Min, Count

In [46]:
# max untuk mencari nilai tertinggi
sample.max()

Nama Band               Trivium
Tahun Berdiri              2004
Pendengar per Bulan    17418362
dtype: object

In [47]:
# min untuk mencari nilai terendah
sample.min()

Nama Band              As I Lay Dying
Tahun Berdiri                    1983
Pendengar per Bulan            996422
dtype: object

In [48]:
# jumlah non null record pada setiap kolom
sample.count()

Nama Band              11
Tahun Berdiri          11
Pendengar per Bulan    11
dtype: int64

describe()

In [49]:
# ringkasan statistik data
sample.describe()

       Tahun Berdiri  Pendengar per Bulan
count      11.000000         1.100000e+01
mean     1994.272727         7.722076e+06
std         6.512924         5.894113e+06
min      1983.000000         9.964220e+05
25%      1990.500000         3.460209e+06
50%      1995.000000         5.910689e+06
75%      1999.000000         1.205513e+07
max      2004.000000         1.741836e+07

Rename dan drop Kolom

In [50]:
# rename kolom
sample = sample.rename(columns={'nama_Band':'Band'})
sample

               Nama Band  Tahun Berdiri  Pendengar per Bulan
0               Slipknot           1995              6603189
1            Linkin Park           1996             17418362
2      Avenged Sevenfold           1999              5410274
3   Bring Me the Horizon           2004              4428374
4              Green Day           1987             15692462
5                   Muse           1994              8528417
6         As I Lay Dying           2000               996422
7                Trivium           1999              1880758
8            Limp Bizkit           1994              5910689
9               Skid Row           1986              2492044
10              Bon Jovi           1983             15581843

In [51]:
# drop atau menghilangkan kolom
sample = sample.drop(columns=['Tahun Berdiri'])
sample

               Nama Band  Pendengar per Bulan
0               Slipknot              6603189
1            Linkin Park             17418362
2      Avenged Sevenfold              5410274
3   Bring Me the Horizon              4428374
4              Green Day             15692462
5                   Muse              8528417
6         As I Lay Dying               996422
7                Trivium              1880758
8            Limp Bizkit              5910689
9               Skid Row              2492044
10              Bon Jovi             15581843

Iloc

In [52]:
# menampilkan record 1 kolom (Nama Band yang berada di indeks ke-1)
sample.iloc[:,1]

0      6603189
1     17418362
2      5410274
3      4428374
4     15692462
5      8528417
6       996422
7      1880758
8      5910689
9      2492044
10    15581843
Name: Pendengar per Bulan, dtype: int64

In [53]:
# menampilkan 3 record pertama dari 1 kolom (Nama Band)
sample.iloc[0:4]

              Nama Band  Pendengar per Bulan
0              Slipknot              6603189
1           Linkin Park             17418362
2     Avenged Sevenfold              5410274
3  Bring Me the Horizon              4428374

In [54]:
# tampilkan kembali semua baris dan kolom
sample.iloc[:,:]

               Nama Band  Pendengar per Bulan
0               Slipknot              6603189
1            Linkin Park             17418362
2      Avenged Sevenfold              5410274
3   Bring Me the Horizon              4428374
4              Green Day             15692462
5                   Muse              8528417
6         As I Lay Dying               996422
7                Trivium              1880758
8            Limp Bizkit              5910689
9               Skid Row              2492044
10              Bon Jovi             15581843

In [55]:
# menampilkan data dari record ke-3 dan kolom ke-2
sample.iloc[3:,2:]

Empty DataFrame
Columns: []
Index: [3, 4, 5, 6, 7, 8, 9, 10]

Loc

In [56]:
# menampilkan record 1 kolom, dengan menulis nama kolomnya("Nama Band")
sample.loc[:,"Nama Band"]

0                 Slipknot
1              Linkin Park
2        Avenged Sevenfold
3     Bring Me the Horizon
4                Green Day
5                     Muse
6           As I Lay Dying
7                  Trivium
8              Limp Bizkit
9                 Skid Row
10                Bon Jovi
Name: Nama Band, dtype: object

In [57]:
# menampilkan record dari indeks ke-0 sampai ke-3 dari kolom "Nama Band"
sample.loc[0:3,"Nama Band"]

0                Slipknot
1             Linkin Park
2       Avenged Sevenfold
3    Bring Me the Horizon
Name: Nama Band, dtype: object

In [58]:
# menampilkan record sampai indeks ke-3 dari kolom Nama Band sampai Pendengar per Bulan
sample.loc[:3,"Nama Band":"Pendengar per Bulan"]

              Nama Band  Pendengar per Bulan
0              Slipknot              6603189
1           Linkin Park             17418362
2     Avenged Sevenfold              5410274
3  Bring Me the Horizon              4428374

Mengisi Nilai Sama Untuk 1 Kolom

In [59]:
# mengisi nilai 1 untuk kolom "Pendengar per Bulan"
sample['Pendengar per Bulan']=1
sample

               Nama Band  Pendengar per Bulan
0               Slipknot                    1
1            Linkin Park                    1
2      Avenged Sevenfold                    1
3   Bring Me the Horizon                    1
4              Green Day                    1
5                   Muse                    1
6         As I Lay Dying                    1
7                Trivium                    1
8            Limp Bizkit                    1
9               Skid Row                    1
10              Bon Jovi                    1

Sorting

In [60]:
# sorting berdasarkan ascending dari kolom "Nama Band"
sample.sort_values(by='Nama Band')

               Nama Band  Pendengar per Bulan
6         As I Lay Dying                    1
2      Avenged Sevenfold                    1
10              Bon Jovi                    1
3   Bring Me the Horizon                    1
4              Green Day                    1
8            Limp Bizkit                    1
1            Linkin Park                    1
5                   Muse                    1
9               Skid Row                    1
0               Slipknot                    1
7                Trivium                    1

In [61]:
# sorting berdasarkan descending dari kolom "Nama Band"
sample.sort_values(by='Nama Band', ascending=False)

               Nama Band  Pendengar per Bulan
7                Trivium                    1
0               Slipknot                    1
9               Skid Row                    1
5                   Muse                    1
1            Linkin Park                    1
8            Limp Bizkit                    1
4              Green Day                    1
3   Bring Me the Horizon                    1
10              Bon Jovi                    1
2      Avenged Sevenfold                    1
6         As I Lay Dying                    1

Filter

In [62]:
# filter record yang "Pendengar per Bulannya" lebih dari 1 dan akan menampilkan status True atau False
sample['Pendengar per Bulan'] > 1

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
Name: Pendengar per Bulan, dtype: bool

In [63]:
# filter, kemudian tampilkan record-nya
filter1 = sample['Pendengar per Bulan'] > 1
filterbaru = sample[filter1]
filterbaru

Empty DataFrame
Columns: [Nama Band, Pendengar per Bulan]
Index: []

In [64]:
# filter dengan 2 parameter (berdasarkan yang Pendengar per bulannya 1 dan Nama Band Trivium)
filter2 = (sample['Pendengar per Bulan'] > 1) & (sample['Nama Band'] == 'Trivium')
filterbaru2 = sample[filter2]
filterbaru2

Empty DataFrame
Columns: [Nama Band, Pendengar per Bulan]
Index: []